esp32-open-mac/esp-wifi-hal/esp-wifi-hal/src/ll.rs
//! Low Level functions.
//!
//! All functions in this module are unsafe, since their effect may be very context dependent.
use core::{
    iter::IntoIterator,
    ops::RangeInclusive,
    pin::Pin,
    ptr::{NonNull, with_exposed_provenance_mut},
};

use esp_hal::{
    dma::DmaDescriptor,
    interrupt::InterruptHandler,
    peripherals::{LPWR, WIFI as HalWIFI},
};

cfg_select! {
    feature = "esp32" => {
        use esp_hal::peripherals::DPORT as SYSCON;
    }
    feature = "esp32s2" => {

        use esp_hal::peripherals::SYSCON;
    }
    feature = "esp32c3" => {
        use esp_hal::peripherals::APB_CTRL as SYSCON;
    }
}

use esp_phy::{PhyInitGuard, enable_phy};
use macro_bits::{bit, check_bit};

use crate::{
    esp_pac::{Interrupt as PacInterrupt, WIFI, wifi::crypto_key_slot::KEY_VALUE},
    ffi::{disable_wifi_agc, enable_wifi_agc, hal_init, tx_pwctrl_background},
    rates::TxPhyRate,
};

/// Run a reversible sequence of functions either forward or in reverse.
///
/// If `forward` is `true`, the functions will be executed in the order in which they were passed.
/// Otherwise they'll be run in reverse order.
fn run_reversible_function_sequence<T, Iter>(functions: Iter, parameter: T, forward: bool)
where
    T: Copy,
    Iter: IntoIterator<Item = fn(T)>,
    <Iter as IntoIterator>::IntoIter: DoubleEndedIterator,
{
    let for_each_closure = |function: fn(T)| (function)(parameter);

    let function_iter = functions.into_iter();
    if forward {
        function_iter.for_each(for_each_closure);
    } else {
        function_iter.rev().for_each(for_each_closure);
    }
}

#[inline(always)]
/// Split a MAC address into a low [u32] and high [u16].
///
/// Let's hope the compiler optimizes this to two load-store pairs.
fn split_address(address: &[u8; 6]) -> (u32, u16) {
    let (low, high) = address.split_at(4);
    (
        u32::from_ne_bytes(low.try_into().unwrap()),
        u16::from_ne_bytes(high.try_into().unwrap()),
    )
}

/// Parameters for a crypto key slot.
///
/// NOTE: These values can contradict each other, unlike in the user facing API, since this API is
/// intended to only be used with great care.
pub struct KeySlotParameters {
    /// Address of the party, with which this key is shared.
    pub address: [u8; 6],
    /// The key ID.
    ///
    /// This can be in the range from 0-3. All other values will get truncated.
    pub key_id: u8,
    /// The interface using this key.
    pub interface: u8,

    // A key can be for both pairwise and group traffic, if WEP is in use.
    /// Is the key for pairwise traffic.
    pub pairwise: bool,
    /// Is the key for group traffic.
    pub group: bool,

    /// The cryptographic algorithm.
    ///
    /// The mapping can be seen in the following table:
    ///
    /// Algorithm | Number
    /// -- | --
    /// WEP | 1
    /// TKIP | 2
    /// CCMP | 3
    /// SMS4 | 4
    /// (GCMP) | 5
    pub algorithm: u8,
    /// If the algorithm is WEP, is the key 104 bits long.
    pub wep_104: bool,
}
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Clone, Copy, Debug, PartialEq, Eq, Hash)]
/// The bank of the RX filter.
pub enum RxFilterBank {
    /// Basic Service Set Identifier (BSSID)
    Bssid,
    /// Receiver Address
    ReceiverAddress,
}
impl RxFilterBank {
    pub(crate) fn into_bits(self) -> usize {
        match self {
            Self::Bssid => 0,
            Self::ReceiverAddress => 1,
        }
    }
}
macro_rules! cause_bitmask {
    ([$($(@chip($chips:tt))? $mask:expr),*]) => {
        const {
            let mut temp = 0;
            $(
                #[allow(unused)]
                let mut condition = true;
                $(
                    condition = cfg!(any($chips));
                )?
                temp |= if condition { $mask } else { 0 };
            )*
            temp
        }
    };
    ($mask:expr) => {
        $mask
    };
}
/// Create a struct to access the cause of an interrupt.
///
/// All declared accessor functions are marked as `inline`, since they are basically just a mask
/// and a compare.
macro_rules! interrupt_cause_struct {
    ($(#[$struct_meta:meta])* $struct_name:ident => {
        $(
            $(#[$function_meta:meta])*
            $function_name:ident => $mask:tt
        ),*
    }) => {
        $(#[$struct_meta])*
        #[cfg_attr(feature = "defmt", derive(defmt::Format))]
        #[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
        #[repr(C)]
        pub struct $struct_name(u32);
        impl $struct_name {
            #[inline]
            /// Get the raw interrupt cause.
            pub const fn raw_cause(&self) -> u32 {
                self.0
            }
            #[inline]
            /// Is there no known cause for the interrupt.
            pub fn is_empty(&self) -> bool {
                self.0 == 0
            }
            $(
                #[inline]
                $(#[$function_meta])*
                pub fn $function_name(&self) -> bool {
                    (self.0 & cause_bitmask!($mask)) != 0
                }
            )*
        }
    };
}
interrupt_cause_struct! {
    /// Cause for the MAC interrupt.
    MacInterruptCause => {
        /// A frame was received.
        ///
        /// We don't know, what the individual bits mean, but this works.
        rx => [0x100020, @chip(esp32) 0x4, @chip(esp32c3) 0x1204000],
        /// A frame was transmitted successfully.
        tx_success => 0x80,
        /// A transmission timeout occured.
        ///
        /// We think this might have something to do with waiting for medium access.
        tx_timeout => 0x80000,
        /// A transmission collision occured.
        ///
        /// This might be caused by multiple transmissions with different ACs getting a TXOP at the
        /// same time.
        tx_collision => 0x100
    }
}
#[cfg(pwr_interrupt_present)]
interrupt_cause_struct! {
    /// Cause for the power interrupt.
    PwrInterruptCause => {
        /// A TBTT was reached or is about to be reached.
        ///
        /// NOTE: This is an unconfirmed assumption.
        tbtt => [@chip(esp32s2) 0x1e],
        /// We don't know them meaning of this yet.
        tsf_timer => [@chip(esp32s2) 0x1e0]
    }
}

#[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
/// The different interrupts of the Wi-Fi peripheral.
pub enum WiFiInterrupt {
    /// Medium Access Control interrupt
    Mac,
    #[cfg(pwr_interrupt_present)]
    /// Low power interrupt
    Pwr,
    // With chips supporting Wi-Fi 6, there will be a BSS Color interrupt here.
}
impl From<WiFiInterrupt> for PacInterrupt {
    fn from(value: WiFiInterrupt) -> Self {
        match value {
            WiFiInterrupt::Mac => PacInterrupt::WIFI_MAC,
            #[cfg(pwr_interrupt_present)]
            WiFiInterrupt::Pwr => PacInterrupt::WIFI_PWR,
        }
    }
}
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
/// Errors that can occur with channel access.
///
/// If such an error gets raised, nothing was transmitted yet.
///
/// Unlike [MacProtocolError], this error type does not have an `Unknown` variant, as it is
/// determined through the MAC interrupt cause, which indicates both TX and RX events, so it is not
/// possible to cleanly identify an unknown TX error, as such.
pub enum ChannelAccessError {
    /// A timeout occured.
    ///
    /// This may be related to the timeout parameter.
    Timeout,
    /// A collision occured.
    ///
    /// This might be caused by internal TX queue scheduling conflicts.
    Collision,
}
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
/// Errors that can occur with the MAC protocol, like MPDU delivery.
///
/// NOTE: Yeah I know, the naming of this and [ChannelAccessError] aren't great, but it's the best
/// I've got.
pub enum MacProtocolError {
    /// No ACK was received within the timeout interval.
    AckTimeout,
    /// No CTS was received within the timeout interval.
    CtsTimeout,
    /// The specified [ChannelAccessError] occured, while attempting to transmit the RTS.
    RtsChannelAccessError(ChannelAccessError),
    /// The key ID in the frame didn't match the one of the specified key slot.
    ///
    /// NOTE: This is to some degree a guess, and purely derived from the function name
    /// `lmacProcessTxseckiderr`. This isn't tested yet.
    InvalidKeyId,
    /// An unknown error occured.
    Unknown {
        /// The main error field.
        error: u8,
        /// We don't really know.
        sub_error: u8,
    },
}
#[derive(Clone, Copy, Debug, PartialEq, Eq, PartialOrd, Ord, Hash)]
/// Status of the TX slot.
pub enum HardwareTxQueueStatus {
    /// The slot is currently disabled and the data in it may be invalid.
    Disabled,
    /// The data in the slot is valid, but the slot is not marked as ready yet.
    Valid,
    /// The data in the slot is valid and it is ready for transmission.
    Ready,
}
impl HardwareTxQueueStatus {
    /// Is the data in the slot valid.
    fn valid(&self) -> bool {
        *self != Self::Disabled
    }
    /// Is the slot enabled for transmission.
    fn enabled(&self) -> bool {
        *self == Self::Ready
    }
}

#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Clone, Copy, Debug, Default, PartialEq, Eq, PartialOrd, Ord, Hash)]
/// Controls which control frames pass the filter.
pub struct ControlFrameFilterConfig {
    /// Control frame wrapper
    pub control_wrapper: bool,
    /// Block ACK request (BAR)
    pub block_ack_request: bool,
    /// Block ACK (BA)
    pub block_ack: bool,
    /// PS-Poll
    pub ps_poll: bool,
    /// Request-to-send (RTS)
    pub rts: bool,
    /// Clear-to-send (CTS)
    pub cts: bool,
    /// ACK
    pub ack: bool,
    /// Control frame end
    pub cf_end: bool,
    /// Control frame end and ACK
    pub cf_end_cf_ack: bool,
}
impl ControlFrameFilterConfig {
    /// Disable reception of all control frames.
    pub fn none() -> Self {
        Self::default()
    }
    /// Receive all control frames.
    pub fn all() -> Self {
        Self {
            control_wrapper: true,
            block_ack_request: true,
            block_ack: true,
            ps_poll: true,
            rts: true,
            cts: true,
            ack: true,
            cf_end: true,
            cf_end_cf_ack: true,
        }
    }
}

#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Clone, Copy, Debug, Default, PartialEq, Eq, PartialOrd, Ord, Hash)]
/// The EDCA access category.
///
/// It maps the EDCA access category to the hardware TX slot number.
pub enum EdcaAccessCategory {
    /// BA-AC
    Background = 1,
    #[default]
    /// BE-AC
    BestEffort = 2,
    /// VI-AC
    Video = 3,
    /// VO-AC
    Voice = 4,
}
impl EdcaAccessCategory {
    /// The default queue used for management frames.
    pub const DEFAULT_MANAGEMENT_QUEUE: HardwareTxQueue =
        HardwareTxQueue::Edcaf(EdcaAccessCategory::Voice);

