esp32-open-mac/esp-wifi-hal/esp-wifi-hal/src/ll.rs
    #[inline]
    /// Get the default contention window exponent range.
    ///
    /// See 9-194 in IEEE 802.11-2024, which applies to us, as we're probably not a
    /// sensor STA and don't do OCB.
    pub const fn default_cw_exponent_range(&self) -> RangeInclusive<u8> {
        match self {
            EdcaAccessCategory::Background => 4..=10,
            EdcaAccessCategory::BestEffort => 4..=10,
            EdcaAccessCategory::Video => 3..=10,
            EdcaAccessCategory::Voice => 2..=10,
        }
    }
    #[inline]
    /// Get the IEEE 802.11 Access Category Index (ACI).
    pub const fn access_category_index(&self) -> usize {
        match *self {
            Self::Background => 1,
            Self::BestEffort => 0,
            Self::Video => 2,
            Self::Voice => 3,
        }
    }
    #[inline]
    /// Convert the Access Category Index (ACI) into our AC type.
    pub const fn from_access_category_index(access_category_index: usize) -> Option<Self> {
        Some(match access_category_index {
            1 => Self::Background,
            0 => Self::BestEffort,
            2 => Self::Video,
            3 => Self::Voice,
            _ => return None,
        })
    }
    #[inline]
    /// Get the hardware slot number.
    ///
    /// NOTE: This slot numbering does not line up, with the one used by Espressif, as we index the
    /// slots in ascending address order (i.e. slot 0 registers have the lowest addresses), not
    /// descending order (i.e. slot 0 register have the highest addresses), which is used in the
    /// proprietary stack. This makes no difference in practice, other than being subjectively less
    /// confusing.
    pub const fn hardware_slot(&self) -> usize {
        *self as usize
    }
    #[inline]
    /// Get the EDCA queue from the slot number.
    ///
    /// NOTE: This slot numbering does not line up, with the one used by Espressif, as we index the
    /// slots in ascending address order (i.e. slot 0 registers have the lowest addresses), not
    /// descending order (i.e. slot 0 register have the highest addresses), which is used in the
    /// proprietary stack. This makes no difference in practice, other than being subjectively less
    /// confusing.
    pub const fn from_hardware_slot(slot: usize) -> Option<Self> {
        Some(match slot {
            1 => Self::Background,
            2 => Self::BestEffort,
            3 => Self::Video,
            4 => Self::Voice,
            _ => return None,
        })
    }
}
#[cfg_attr(feature = "defmt", derive(defmt::Format))]
#[derive(Clone, Copy, Debug, Default, PartialEq, Eq, PartialOrd, Ord, Hash)]
/// The hardware TX queues.
///
/// Usually you want to use [EdcaAccessCategory::Voice] for non QoS traffic and management frames.
pub enum HardwareTxQueue {
    #[default]
    /// Beacon transmission.
    ///
    /// This is very likely the queue for beacon transmission. It likely bypasses all other channel
    /// access mechanisms, as beacon frames are fairly time critical.
    Beacon,
    /// Enhanced Distributed Channel Access Function
    ///
    /// This is the modified channel access function used for QoS traffic.
    Edcaf(EdcaAccessCategory),
}
impl HardwareTxQueue {
    #[inline]
    /// Get the default AIFSN for the TX queue.
    ///
    /// See 9-194 in IEEE 802.11-2024, which applies to us, as we're probably not a
    /// sensor STA and don't do OCB. The AIFSN for the beacon queue is taken from esp-wifi.
    pub const fn default_aifsn(&self) -> u8 {
        if let Self::Edcaf(edca_ac) = self {
            match *edca_ac {
                EdcaAccessCategory::Background => 7,
                EdcaAccessCategory::BestEffort => 3,
                EdcaAccessCategory::Video => 2,
                EdcaAccessCategory::Voice => 2,
            }
        } else {
            1
        }
    }
    #[inline]
    /// Get the hardware slot number.
    ///
    /// NOTE: This slot numbering does not line up, with the one used by Espressif, as we index the
    /// slots in ascending address order (i.e. slot 0 registers have the lowest addresses), not
    /// descending order (i.e. slot 0 register have the highest addresses), which is used in the
    /// proprietary stack. This makes no difference in practice, other than being subjectively less
    /// confusing.
    pub const fn hardware_slot(&self) -> usize {
        match *self {
            Self::Beacon => 0,
            Self::Edcaf(access_category) => access_category.hardware_slot(),
        }
    }
    #[inline]
    /// Get the queue from the slot number.
    ///
    /// NOTE: This slot numbering does not line up, with the one used by Espressif, as we index the
    /// slots in ascending address order (i.e. slot 0 registers have the lowest addresses), not
    /// descending order (i.e. slot 0 register have the highest addresses), which is used in the
    /// proprietary stack. This makes no difference in practice, other than being subjectively less
    /// confusing.
    pub const fn from_hardware_slot(slot: usize) -> Option<Self> {
        if slot == 0 {
            Some(Self::Beacon)
        } else if let Some(edca_ac) = EdcaAccessCategory::from_hardware_slot(slot) {
            Some(Self::Edcaf(edca_ac))
        } else {
            None
        }
    }
    #[inline]
    /// Is the queue an EDCA queue.
    pub const fn is_edca(&self) -> bool {
        matches!(self, Self::Edcaf(_))
    }
}
impl From<EdcaAccessCategory> for HardwareTxQueue {
    fn from(value: EdcaAccessCategory) -> Self {
        Self::Edcaf(value)
    }
}

#[cfg(any(feature = "esp32", feature = "esp32s2", feature = "esp32c3"))]
/// The number of "interfaces" supported by the hardware.
pub const INTERFACE_COUNT: usize = 4;

/// The number of key slots the hardware has.
pub const KEY_SLOT_COUNT: usize = 25;

#[cfg(feature = "esp32")]
static MAC_TIME_OFFSET: portable_atomic::AtomicU64 = portable_atomic::AtomicU64::new(0);

/// Low level driver for the Wi-Fi peripheral.
///
/// This is intended as an intermediary layer between the user facing API and the hardware, to make
/// driver maintenance easier.
///
/// # Implementation specifics
/// ## TX
/// ### Slot Numbering
/// The hardware has 5 TX slots
/// The slot numbering used for TX is aligned with that of the proprietary stack, not with the
/// hardware. This means, that our slot numbering is reversed compared to the hardware slot
/// registers, as this reduces confusion when reverse engineering. Our slot 0 would therefore be
/// the highest slot in the hardware (i.e. slot 4).
///
/// # Safety
/// Pretty much all of the functions on this must be used with extreme caution, as the intention is
/// not to provide a fool proof API for the user, but a thin abstraction over the hardware, to make
/// development of the user facing API easier. A lot of the private functions do not take `&self`
/// as a parameter, as they must also be callable during initialization and aren't intended for
/// direct use anyways. Always pay close attention to their respective docs.
///
/// # Panics
/// A lot of the functions, that can panic, will do so under similar conditions, so the docs are
/// shared. When an index (i.e. key slot or interface) is provided, it is expected, that the input
/// is within the valid range. If it is not, the function will panic.
pub struct LowLevelDriver {
    /// Prevents the PHY from being disabled, while the driver is running.
    _phy_init_guard: Option<PhyInitGuard<'static>>,
}
impl LowLevelDriver {
    /// Get the PAC Wi-Fi peripheral.
    ///
    /// # Safety
    /// This is only intended to be used for debugging and development purposes. The ways you can
    /// shoot yourself in the foot, by accessing the peripheral directly, are way too many to list.
    /// Using this should be a last resort and only be done, if you know what you're doing.
    pub unsafe fn regs() -> WIFI {
        Self::regs_internal()
    }
    /// Get the PAC Wi-Fi peripheral.
    ///
    /// This stops rust-analyzer from doing funky shit.
    fn regs_internal() -> WIFI {
        unsafe { WIFI::steal() }
    }
    /// Create a new [LowLevelDriver].
    pub fn new(_wifi: esp_hal::peripherals::WIFI<'_>) -> Self {
        // The reason we first create the struct an then initialize it, is so that we can access
        // methods during init.
        unsafe {
            Self {
                _phy_init_guard: None,
            }
            .init()
        }
    }

    // Initialization

    /// Set the power and reset status of the Wi-Fi peripheral module.
    ///
    /// # Safety
    /// Enabling or disabling the Wi-Fi PD, outside of init or deinit, breaks a lot of assumptions
    /// other code makes, so take great care.
    unsafe fn set_module_status(&self, enable_module: bool) {
        // For newer chips, we also have to handle the reset of the RF modules.
        run_reversible_function_sequence(
            [
                // Enable or disable forced power down
                |power_down| {
                    LPWR::regs()
                        .dig_pwc()
                        .modify(|_, w| w.wifi_force_pd().bit(power_down));
                },
                // Enable or disable isolation
                |isolate| {
                    LPWR::regs()
                        .dig_iso()
                        .modify(|_, w| w.wifi_force_iso().bit(isolate));
                },
            ],
            !enable_module,
            enable_module,
        );
    }
    /// Perform a full MAC reset.
    ///
    /// # Safety
    /// This will basically reset all state of the MAC to its defaults. Therefore it may also break
    /// assumptions made by some pieces of code.
    unsafe fn reset_mac(&self) {
        // Perform a full reset of the Wi-Fi module.
        cfg_select! {
            any(feature = "esp32", feature = "esp32s2", feature = "esp32c3") => {
                let syscon = SYSCON::regs();
                syscon.wifi_rst_en().modify(|_, w| w.mac_rst().set_bit());
                syscon.wifi_rst_en().modify(|_, w| w.mac_rst().clear_bit());
            }
            _ => compile_error!("Adjust this for a new chip.")
        }
        // NOTE: coex_bt_high_prio would usually be here

        // Disable RX
        unsafe {
            Self::set_rx_enable(false);
        }
    }
    /// Initialize or deinitialize the MAC.
    ///
    /// If `intialized` is `true`, the MAC will be initialized, and vice versa.
    /// # Safety
    /// We don't really know, what exactly this does, so we only call it, where the closed source
    /// driver would.
    unsafe fn set_mac_state(&self, intialized: bool) {
        // TODO: Figure out, what these registers do precisely and move them into the PAC.
        cfg_select! {
            feature = "esp32" => {
                const MAC_INIT_MASK: u32 = 0xffffe800;
                const MAC_READY_MASK: u32 = 0x2000;
            }
            feature = "esp32s2" => {
                const MAC_INIT_MASK: u32 = 0xff00efff;
                const MAC_READY_MASK: u32 = 0x6000;
            }
            feature = "esp32c3" => {
                // From hal_mac_init/hal_mac_deinit in the ESP32-C3 libpp blob: the same bits as
                // on the ESP32-S2, in the CTRL register at offset 0xca0.
                const MAC_INIT_MASK: u32 = 0xff00efff;
                const MAC_READY_MASK: u32 = 0x6000;
            }
            _ => {
                compile_error!("The MAC init mask may have to be updated for different chips.");
            }
        }
        // Spin until the MAC state is marked as ready.
        // This is only required on the ESP32-S2.
        while !intialized
            && cfg!(any(feature = "esp32s2", feature = "esp32c3"))
            && Self::regs_internal().ctrl().read().bits() & MAC_READY_MASK != 0
        {}
        // If we are initializing the MAC, we need to clear some bits, by masking the reg, with the
        // MAC_INIT_MASK. On deinit, we need to set the bits we previously cleared.
        Self::regs_internal().ctrl().modify(|r, w| unsafe {
            w.bits(if intialized {
                r.bits() & MAC_INIT_MASK
            } else {
                r.bits() | !MAC_INIT_MASK
            })
        });

        // Spin until the MAC is no longer ready.
        while !intialized && Self::regs_internal().ctrl().read().bits() & MAC_READY_MASK != 0 {}
    }
    #[inline]
    /// Setup relevant blocks of the MAC.
    ///
    /// # Safety
    /// This should only be called during init.
    unsafe fn setup_mac(&self) {
        // We call the proprietary blob here, to do some init for us. In the long term, this will
        // be moved to open source code. In the meantime, we do the init, that we already understand a
        // second time in open source code, which should have no bad effects.
        unsafe {
            #[cfg(osi_funcs_in_rom)]
            crate::ffi::install_osi_funcs();
            hal_init();
        }

