esp32-open-mac/esp-wifi-hal/esp-wifi-hal/src/ll.rs
        // Open source setup code
        self.setup_filtering();
        self.setup_crypto();
    }
    /// Initialize the hardware.
    ///
    /// As modem sleep is currently unimplemented, this does a full initialization.
    ///
    /// This includes:
    /// - Enabling the Wi-Fi power domain and modem clock
    /// - Initializing the PHY
    /// - Initializing the MAC
    /// - Setting up basic hardware functionality, like the MAC RX filters and crypto.
    ///
    /// What it doesn't do:
    /// - Enabling RX and setting up the DMA list
    /// - Setting any addresses
    /// - Setting an interrupt handler
    ///
    /// # Safety
    /// At the moment, this is only intended to be called upon initializing the low level driver.
    /// Reinitialization and partial PHY calibration are NOT handled at all. The effects of calling
    /// this multiple times are unknown.
    unsafe fn init(mut self) -> Self {
        // Enable the power domain.
        unsafe {
            self.set_module_status(true);
        }
        #[cfg(esp32)]
        esp_phy::set_mac_time_update_cb(|duration| {
            let _ = MAC_TIME_OFFSET
                .fetch_add(duration.as_micros(), core::sync::atomic::Ordering::Relaxed);
        });
        // Enable the modem clock.
        let enable_mask = cfg_select! {
            feature = "esp32" => 0x00000406,
            feature = "esp32s2" => 0x000007cf,
            // SYSTEM_WIFI_CLK_EN as used by esp_perip_clk_init in ESP-IDF (and esp-radio).
            feature = "esp32c3" => 0x00fb9fcf,
            _ => compile_error!("If you're adding a new chip, you have to adjust the modem clock enable mask.")
        };
        SYSCON::regs()
            .wifi_clk_en()
            .modify(|r, w| unsafe { w.bits(r.bits() | enable_mask) });
        // Initialize the PHY.
        self._phy_init_guard = Some(enable_phy());
        unsafe {
            self.reset_mac();
            self.set_mac_state(true);
            self.setup_mac();
        }
        self
    }

    // Interrupt handling

    #[inline(always)]
    /// Get and clear the MAC interrupt cause.
    ///
    /// # Safety
    /// This is expected to be called ONLY from the MAC interrupt handler.
    pub unsafe fn get_and_clear_mac_interrupt_cause() -> MacInterruptCause {
        let cause = Self::regs_internal()
            .mac_interrupt()
            .wifi_int_status()
            .read()
            .bits();
        Self::regs_internal()
            .mac_interrupt()
            .wifi_int_clear()
            .write(|w| unsafe { w.bits(cause) });
        MacInterruptCause(cause)
    }
    #[cfg(pwr_interrupt_present)]
    #[inline(always)]
    /// Get and clear the PWR interrupt cause.
    ///
    /// # Safety
    /// This is expected to be called ONLY from the MAC interrupt handler.
    pub unsafe fn get_and_clear_pwr_interrupt_cause() -> PwrInterruptCause {
        let cause = Self::regs_internal()
            .pwr_interrupt()
            .pwr_int_status()
            .read()
            .bits();
        Self::regs_internal()
            .pwr_interrupt()
            .pwr_int_clear()
            .write(|w| unsafe { w.bits(cause) });
        PwrInterruptCause(cause)
    }
    /// Configure the specified interrupt.
    ///
    /// Usually all relevant interrupts are bound to the same interrupt handler and CPU interrupt.
    pub fn configure_interrupt(
        &self,
        interrupt: WiFiInterrupt,
        interrupt_handler: InterruptHandler,
    ) {
        let wifi = unsafe { HalWIFI::steal() };

        match interrupt {
            WiFiInterrupt::Mac => {
                wifi.bind_mac_interrupt(interrupt_handler);
                wifi.enable_mac_interrupt(interrupt_handler.priority());
            }
            #[cfg(pwr_interrupt_present)]
            WiFiInterrupt::Pwr => {
                wifi.bind_pwr_interrupt(interrupt_handler);
                wifi.enable_pwr_interrupt(interrupt_handler.priority());
            }
        }
    }

    // RX

    #[inline]
    /// Enable or disable the receiving of frames.
    ///
    /// # Safety
    /// Enabling RX, when the DMA list isn't setup correctly yet, may be incorrect.
    pub(crate) unsafe fn set_rx_enable(enable_rx: bool) {
        Self::regs_internal()
            .rx_ctrl()
            .modify(|_, w| w.rx_enable().bit(enable_rx));
    }
    #[inline]
    /// Check if RX is enabled.
    ///
    /// We don't know, if this influences the RF frontend in any way.
    pub fn rx_enabled(&self) -> bool {
        Self::regs_internal().rx_ctrl().read().rx_enable().bit()
    }
    /// Tell the hardware to reload the RX descriptors.
    ///
    /// This will spin, until the bit is clear again.
    pub fn reload_hw_rx_descriptors(&self) {
        let wifi = Self::regs_internal();
        let reg = wifi.rx_ctrl();

        // Start the reload.
        reg.modify(|_, w| w.rx_descr_reload().set_bit());

        // Wait for the hardware descriptors to no longer be in reload.
        while reg.read().rx_descr_reload().bit() {}
    }
    /// Set the base descriptor.
    pub fn set_base_rx_descriptor(&self, base_descriptor: NonNull<DmaDescriptor>) {
        Self::regs_internal()
            .rx_dma_list()
            .rx_descr_base()
            .write(|w| unsafe { w.bits(base_descriptor.expose_provenance().get() as u32) });
        self.reload_hw_rx_descriptors();
    }
    /// Reset the base descriptor.
    pub fn clear_base_rx_descriptor(&self) {
        Self::regs_internal().rx_dma_list().rx_descr_base().reset();
        self.reload_hw_rx_descriptors();
    }
    /// Start receiving frames.
    ///
    /// This will set the provided descriptor as the base of the RX DMA list and enable RX.
    pub fn start_rx(&self, base_descriptor: NonNull<DmaDescriptor>) {
        self.set_base_rx_descriptor(base_descriptor);
        unsafe {
            Self::set_rx_enable(true);
        }
    }
    /// Stop receiving frames.
    ///
    /// This will also clear the RX DMA list.
    pub fn stop_rx(&self) {
        unsafe {
            Self::set_rx_enable(false);
        }
        self.clear_base_rx_descriptor();
    }
    /// Get the base RX descriptor.
    pub fn base_rx_descriptor(&self) -> Option<NonNull<DmaDescriptor>> {
        NonNull::new(with_exposed_provenance_mut(
            Self::regs_internal()
                .rx_dma_list()
                .rx_descr_base()
                .read()
                .bits() as usize,
        ))
    }
    /// Get the next RX descriptor.
    pub fn next_rx_descriptor(&self) -> Option<NonNull<DmaDescriptor>> {
        NonNull::new(with_exposed_provenance_mut(
            Self::regs_internal()
                .rx_dma_list()
                .rx_descr_next()
                .read()
                .bits() as usize,
        ))
    }
    /// Get the last RX descriptor.
    pub fn last_rx_descriptor(&self) -> Option<NonNull<DmaDescriptor>> {
        NonNull::new(with_exposed_provenance_mut(
            Self::regs_internal()
                .rx_dma_list()
                .rx_descr_last()
                .read()
                .bits() as usize,
        ))
    }

    // RX filtering

