esp32-open-mac/esp-wifi-hal/esp-wifi-hal/src/ll.rs
    // Timing

    /// Get the offset between the system timers and the MAC timer.
    pub fn mac_time_offset() -> esp_hal::time::Duration {
        cfg_select! {
            esp32 => {
                let offset = MAC_TIME_OFFSET.load(core::sync::atomic::Ordering::Relaxed);
            }
            _ => {
                let offset = 0;
            }
        }
        esp_hal::time::Duration::from_micros(offset)
    }
    /// Get the current value of the MAC timer.
    ///
    /// # Safety
    /// This must only be called, when the Wi-Fi peripheral is initialized.
    pub unsafe fn mac_time() -> esp_hal::time::Instant {
        esp_hal::time::Instant::EPOCH
            + esp_hal::time::Duration::from_micros(
                Self::regs_internal().mac_time().read().bits() as u64
            )
            + Self::mac_time_offset()
    }

    // RF

    /// Set the radio channel.
    ///
    /// The channel number is not validated.
    pub fn set_channel(&self, channel_number: u8) {
        unsafe {
            self.set_mac_state(false);
            cfg_select! {
                nomac_channel_set => {
                    crate::ffi::chip_v7_set_chan_nomac(channel_number, 0);
                }
                _ => {
                    crate::ffi::chip_v7_set_chan(channel_number, 0);
                }
            }
            disable_wifi_agc();
            self.set_mac_state(true);
            enable_wifi_agc();
        }
    }
    /// Run TX power control.
    ///
    /// We don't really know, what this does.
    pub fn run_power_control(&self) {
        unsafe {
            tx_pwctrl_background(1, 0);
        }
    }
}
